<a href="https://colab.research.google.com/github/ga0808/sql/blob/main/%EC%8B%A4%EC%8A%B51.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
# 실습 환경 설명해주기

# 실습배경
# 지시사항
# 코드창
# 결과 출력
#--> 안내하기

In [ ]:
# 관계형 데이터 베이스

In [ ]:
# 실습 1

#DESC문을 이용해 employees 테이블의 구조를 출력해보세요.
DESC employees;

# DESC문을 이용해 salaries 테이블의 구조를 출력해보세요.
DESC salaries;

# extra : SQL문을 어떻게 수행할 것인지에 대한 추가 정보를 보여주는 항목

교안으로

In [ ]:
# 실습 2 - SELECT 1

# SELECT문을 이용해 book테이블을 조회하는 쿼리를 작성해주세요.
select * from book;

In [ ]:
# 실습 3 - SELECT 2

# SELECT문을 이용해 employees테이블을 조회하는 쿼리를 작성해주세요.

# * 은 모든 컬럼을 모두 확인할 수 있음
SELECT * FROM employees;

In [ ]:
# 실습 4 - SELECT 3

# book 테이블의 구조를 조회하는 쿼리입니다. 수정하실 필요는 없습니다.
DESC book;

# 책의 제목과 저자만 골라서 조회하는 쿼리를 작성해주세요.
# 특정 컬럼명만 적으면, 특정 컬럼들만 추출하여 조회 가능
SELECT title, author FROM book;

교안으로

In [ ]:
# 실습 5 - DISTINCT

# salaries 테이블에 있는 직원 번호를 중복 없이 출력해 봅니다.
SELECT DISTINCT emp_no FROM salaries;

In [ ]:
# 퀴즈 2

# 관계형 데이터베이스
# 비관계형 데이터베이스 : https://gaemi606.tistory.com/entry/NoSQL%EB%B9%84%EA%B4%80%EA%B3%84%ED%98%95-%EB%8D%B0%EC%9D%B4%ED%84%B0%EB%B2%A0%EC%9D%B4%EC%8A%A4-%EC%95%8C%EC%95%84%EB%B3%B4%EA%B8%B0
# navigational database : 주로 다른 객체의 참조를 따라 레코드 나 객체를 찾는 유형의 데이터베이스
#               트리구조나 그래프 구조로 데이터가 조직된 형태로 60~70년대에 사용 다수

교안으로

In [ ]:
# 실습 6 - WHERE 1

# 테이블의 구조를 출력하는 쿼리입니다. 실행 버튼을 눌러보시면 테이블의 구조를 알 수 있습니다.
DESC book;

# Joanne Kathleen Rowling작가의 책만 골라서 조회하는 쿼리를 작성해주세요.
select * from book
where author = 'Joanne Kathleen Rowling';

In [ ]:
# 실습 7 - WHERE 2

# gender가 'M'인 직원만 골라서 조회하는 쿼리를 작성해주세요.
SELECT * FROM employees
WHERE gender = 'M';

In [ ]:
# 퀴즈 3 : where
# 나머진 없는 명령어

교안으로

In [ ]:
# 실습 8

DESC score;

# 수학 점수가 80점 초과, 국어 점수가 90점 이상인 학생의 정보를 검색해보세요.
select *
from score
where math > 80 and korean >= 90;

In [ ]:
# 실습 9

# 여자 직원 중 이름이 Chirstian인 직원들을 출력합니다.
SELECT * FROM employees
WHERE gender = 'F'
AND first_name = 'Chirstian';

In [ ]:
# 실습 10 - and/ or/ not

# 문제의 조건에 맞는 직원을을 출력합니다.
SELECT *
FROM employees
WHERE (first_name = 'Chirstian' OR first_name = 'Georgi') #우선순위 주의
AND gender = 'M'
AND NOT hire_date = '1986-06-26';

교안으로

In [ ]:
# 실습 11 - between

DESC score;

# 짜장면을 받을 수 있는 학생을 조회하는 쿼리를 작성해주세요.
select * from score
where korean=100 or english=100 or math=100
;

# 과자를 받을 수 있는 학생을 조회하는 쿼리를 작성해주세요.
select * from score
where korean between 70 and 95
and english between 70 and 95
and math between 70 and 95
;

In [ ]:
# 실습 12 - between2

# 1980~1989년도에 입사한 직원을 검색하세요.
SELECT * FROM employees
WHERE hire_date
BETWEEN '1980-01-01' AND '1989-12-31'
;

# 1990~1999년도에 입사한 직원을 검색하세요.
SELECT * FROM employees
WHERE hire_date
BETWEEN '1990-01-01' AND '1999-12-31'
;

교안으로

In [ ]:
# 실습 13

# 책들의 정보가 담긴 테이블의 구조를 출력합니다. 수정하실 필요는 없습니다.
DESC book;

# 해당하는 작가가 쓴 책만 골라서 출력합니다.
select *
from book
where author in ('William Shakespeare', 'John Ronald Reuel Tolkien', 'Joanne Kathleen Rowling')
;

In [ ]:
# 실습 14

# 해당하는 이름을 가진 사람들만 골라서 출력합니다.
SELECT * FROM employees
WHERE last_name IN ('Michaels', 'Genin', 'Peha')
;

In [ ]:
# 퀴즈 4

# and = &&
# or = ||
# https://oneul-losnue.tistory.com/114 : 연산자

교안으로 가서 마무리 내용 복습하고 미션 1,2,3 풀기

In [ ]:
# 미션 1
# 아래에 미션을 수행하는 코드를 작성해 봅시다.

select name from student;
select * from student where gender = 'M';
select height from student where height <= 170;
select weight from student where weight >= 50;

In [ ]:
# 미션 2

# 아래에 미션을 수행하는 코드를 작성해 봅시다.

# 제곰 연산 함수 -> POWER(3,4) = 3의 4제곱
select *, weight / (  (height/100)*(height/100)  )
from student
;


select *, weight / (  (height/100)*(height/100)  )
from student
where weight / ((height/100)*(height/100)) <= 18.5
or weight / ((height/100)*(height/100)) >=25.0
;

In [ ]:
# 미션 3

# 아래에 미션을 수행하는 코드를 작성해 봅시다.

#1.
select * from shareholder;

#2.
select * from shareholder
where stock >= 100000;

#3.
select stock from shareholder
where name in ("Alexis", "Craig", "Fred");

#4.
select name,stock from shareholder
where agree = 0 and stock >= 100000;

#5.
select name,stock from shareholder
where agree = 1 and stock >= 100000;

#6.
select * from shareholder
where stock <= 100000 or stock >= 200000;